{
    "experiences": [
        {
            "date": ["nov/2023", "actualidad"],
            "company": "Beraud Gourmet",
            "position": "Desarrollador web fullstack",
            "content": [
                "Participé en el desarrollo de un ecommerce de pizzas en donde:",
                "- Diseñé y desarrollé interfaces gráficas para las secciones de cliente y administrador de una plataforma de ecommerce.",
                "- Implementé funcionalidades avanzadas como autenticación con Google y manejo de pagos con Stripe.",
                "- Integré Google Maps para permitir a los clientes seleccionar tiendas basadas en su ubicación.",
                "- Creé un sistema para el administrador que permite gestionar productos, ingredientes y tiendas, además de visualizar tablas resumen y detalles."
            ],
            "footer": [
                "NextJS",
                "MUI",
                "TypeScript",
                "ExpressJS",
                "TypeORM",
                "PostgreSQL"
            ]
        },
        {
            "date": ["ago/2023", "sep/2023"],
            "company": "iCreativa",
            "position": "Desarrollador web frontend",
            "content": [
                "- Participé en el desarrollo de una landing page interactiva diseñada para presentar información de manera visualmente atractiva y dinámica.",
                "- Implementé animaciones avanzadas utilizando GSAP, sincronizadas con el movimiento del scroll para mejorar la experiencia del usuario y captar su atención de forma efectiva."
            ],
            "footer": [
                "HTML",
                "CSS",
                "JavaScript",
                "React",
                "GSAP",
                "Git",
                "GitHub"
            ]
        }
    ],
    "proyects": [
        {
            "link": "https://movie-search-engine-ojdw.vercel.app/",
            "image": {
                "url": "/Movie_Search_Engine.png",
                "alt": "Movie Search Engine"
            },
            "title": "Movie Search Engine",
            "content": [
                "Movie Search Engine es una aplicación web diseñada para transformar la manera en que los usuarios buscan y exploran películas. A través de una interfaz limpia e intuitiva, la plataforma ofrece una experiencia rica en detalles, permitiendo a los usuarios filtrar por texto y género, además de navegar por información clave de películas y el elenco." 
            ]
        },
        {
            "link": "https://www.beraudslice.app/",
            "image": {
                "url": "/grupoberaud.jpg",
                "alt": "Grupo Beraud"
            },
            "title": "Grupo Beraud",
            "content": [
                "Grupo Beraud es una plataforma de ecommerce diseñada para simplificar la compra de tu pizza favorita. Navega fácilmente por el catálogo de pizzas disponibles y selecciona tu tienda preferida o solicita delivery a tu ubicación actual. Añade múltiples productos al carrito y realiza pagos seguros con tarjeta de crédito. Regístrate y lleva un control detallado de tus pedidos para gestionar tus compras de manera eficiente.",
                "Como administrador gestiona pedidos, pizzas, tiendas, ingredientes y usuarios mediante una interfaz intuitiva que permite mantener el control total del negocio."
            ]
        },
        {
            "link": "https://scrollytelling-trata.coalicioncorett.com/",
            "image": {
                "url": "/TRATA_PERSONAS.jpg",
                "alt": "Trata_Personas"
            },
            "title": "Trata de personas",
            "content": [
                "Trata de Personas es una página web diseñada para informar y educar sobre un tema crítico mediante una experiencia visualmente atractiva e interactiva. La página presenta información clave a través de elementos multimedia como mapas, notas de interés, animaciones, videos y material de apoyo." 
            ]
        }
    ]
}
